NextFOAM-2506/tutorials/combustion/rhoReactingFoam/groundAbsorption/0.orig/N2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.76699;

boundaryField
{
    "(outlet|sides)"
    {
        type            calculated;
        value           $internalField;
    }

    base
    {
        type            calculated;
        value           $internalField;
    }

    inlet
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
